; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 749630 1 1 3 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared0 - mode
	image1 - mode
	image2 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation5 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
)
(:goal (and
	(have_image Phenomenon7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Star9 image1)
	(have_image Star10 infrared0)
	(have_image Star11 image2)
	(have_image Phenomenon12 image2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 groundstation5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 star9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
5. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 1 of 6
6. (turn_to satellite0 star11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star11)
   goals met: 1 of 6
7. (take_image satellite0 star11 instrument0 image2)
   added: (have_image star11 image2)
   goals met: 2 of 6
8. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 2 of 6
9. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 3 of 6
10. (turn_to satellite0 planet8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet8)
   goals met: 3 of 6
11. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 4 of 6
12. (turn_to satellite0 phenomenon12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 6
13. (take_image satellite0 phenomenon12 instrument0 image2)
   added: (have_image phenomenon12 image2)
   goals met: 5 of 6
14. (turn_to satellite0 phenomenon7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 6
15. (take_image satellite0 phenomenon7 instrument0 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 6 of 6
